In [22]:
# Pandas
import pandas as pd
import os 
# SQL Alchemy

import matplotlib.pyplot as plt
from sqlalchemy import inspect, create_engine
database_path = "../Resources/wk9_employees.sql"

In [23]:
# Create Engine
host = "localhost"
port = 5432
db = "sql_wk9_hw"
user = "postgres"
password = os.environ['PASSWORD']

path = f'postgresql://{user}:{password}@{host}:{port}/{db}'
engine = create_engine(path)

KeyError: 'PASSWORD'

In [14]:
inspector = inspect(engine)

In [20]:
for table in inspector.get_table_names():
    columns = inspector.get_columns(table)
    print(table)
    print()
    for column in columns:
        print(column['name'])
    
    display(pd.DataFrame(columns))
    
    print()

employees

id
emp_no
emp_title_id
birth_date
first_name
last_name
sex
hire_date
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('employees_id_seq'::regclass),True,None
1,emp_no,INTEGER,False,None,False,None
2,emp_title_id,VARCHAR(30),False,None,False,None
3,birth_date,VARCHAR(20),True,None,False,None
4,first_name,VARCHAR(20),False,None,False,None
5,last_name,VARCHAR(20),False,None,False,None
6,sex,VARCHAR(10),False,None,False,None
7,hire_date,VARCHAR(20),False,None,False,None
8,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

dept_emp

id
emp_no
dept_no
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('dept_emp_id_seq'::regclass),True,None
1,emp_no,INTEGER,False,None,False,None
2,dept_no,VARCHAR(30),False,None,False,None
3,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

departments

id
dept_no
dept_name
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('departments_id_seq'::regclass),True,None
1,dept_no,VARCHAR(10),False,None,False,None
2,dept_name,VARCHAR(30),True,None,False,None
3,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

dept_manager

id
dept_no
emp_no
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('dept_manager_id_seq'::regclass),True,None
1,dept_no,VARCHAR(30),False,None,False,None
2,emp_no,INTEGER,False,None,False,None
3,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

title

id
title_id
title
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('title_id_seq'::regclass),True,None
1,title_id,VARCHAR(20),False,None,False,None
2,title,VARCHAR(30),True,None,False,None
3,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

salaries

id
emp_no
salary
last_update

,name,type,nullable,default,autoincrement,comment
0,id,INTEGER,False,nextval('salaries_id_seq'::regclass),True,None
1,emp_no,INTEGER,False,None,False,None
2,salary,INTEGER,False,None,False,None
3,last_update,TIMESTAMP,False,LOCALTIMESTAMP,False,None

In [ ]:
query = """
    Select 
    """